tap "fluxcd/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "twallac10/formulas", "https://github.com/twallac10/homebrew-formulas.git"
brew "libyaml"
brew "readline"
brew "sqlite"
brew "xz"
brew "act"
brew "azure-cli"
brew "bash-completion"
brew "node"
brew "bitwarden-cli"
brew "gdbm"
brew "openssl@1.1"
brew "bpytop"
brew "coreutils"
brew "cloudflared"
brew "docker", link: false
brew "docker-compose"
brew "exercism"
brew "flux"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "gnupg"
brew "helm"
brew "helmfile"
brew "hey"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubebuilder"
brew "kubeconform"
brew "kubectx"
brew "kubelogin"
brew "kumactl"
brew "kustomize"
brew "oras"
brew "pkgconf"
brew "powerlevel10k"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "stern"
brew "tfenv"
brew "terraform-docs"
brew "tmux"
brew "tree"
brew "wget"
brew "yamllint"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "go-task/tap/go-task"
cask "alfred"
cask "arc"
cask "bitwarden"
cask "cleanshot"
cask "docker"
cask "drawio"
cask "firefox"
cask "ghostty"
cask "git-credential-manager"
cask "grammarly"
cask "grammarly-desktop"
cask "insomnia"
cask "obsidian"
cask "postman"
cask "todoist"
cask "visual-studio-code"
vscode "4ops.terraform"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "elagil.pre-commit-helper"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "inercia.vscode-k3d"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "weaveworks.vscode-gitops-tools"
vscode "yzhang.markdown-all-in-one"
